const items = [
  {
    name: "feeder_house",
    imgSrc: "./img/yellow_house.jpg",
    about: `Уникальный дизайн не оставит равнодушными абсолютно никого. А продуманная конструкция, с максимально открытой стороной к окну в ваш дом, позволит рассмотреть всех птиц.`,
    volume: " 0,5 л. корма",
    size: "150х370х50 мм.",
    aboutText: `Кормушки выполнены из качественного пластика производства Израиль, не подвергаются внешнему влиянию (не промокают, не гниют, не теряют внешний вид).
    Для крепления на стекло используются качественные, большие прозрачные присоски, хорошо держатся при любой температуре (проверено много раз, 
    держатся всю зиму в мороз, снег, дождь). Но даже если вы беспокоитесь, что кормушка может отпасть и улететь, предусмотрена система якорь (страховка), 
    одна присоска крепится на окно внутри дома, от которой идет тонкая нить до кормушки.
    Кормушки снабжены инструкцией по эксплуатации. При правильном обращении имеют длительный  срок службы.`
  },
  {
    name: "feeder_photo",
    about: `Премиум кормушка, отлично подойдет на подарок!
    Комплектуется:
    - крафтовая упаковка с древесной стружкой
    - упаковка корма "Hause_for_birds"
    - Инструкция`,
    volume: " 0,8 л. корма",
    size: "160х220х70 мм.",

    aboutText: `Кормушка  изготовлена из акрилового стекла производства Германии. Это кристально прозрачный материал с длительным сроком эксплуатации. В кормушке установлена деревянная деталь для удобной посадки птиц. Сам "Объектив" можно снять, что удобно при чистке.
    Кормушка крепится к окну на три качественные присоски диаметром 40 мм. Крепёж присосок позволяет производить легко их замену. 
    На случай небрежного крепления или грязного стекла, для недопущения потери кормушки, она укомплектована нашей системой "Якорь", состоящей из капронового шнура и декоративного  якоря.
    Кормушка снабжена инструкцией по эксплуатации и при правильном обращении имеют долгий срок службы   
    Если вы хотите рассматривать и фотографировать птиц без помех, то акриловые кормушки для вас!`
  },
  {
    name: "feeder_lodgy",
    about: `Кормушка для птиц "Лоджия" предназначена для кормления мелких птиц. Кормушка  изготовлена из акрилового стекла производства Германии. Это кристально прозрачный материал с длительным сроком эксплуатации. В кормушке установлена деревянная деталь для удобной посадки птиц.  `,
    volume: "0,3 л. корма",
    size: "110х180х70 мм.",
    aboutText: `Для крепления на стекло используются качественные, большие прозрачные присоски, хорошо держатся при любой температуре (проверено много раз, держатся всю зиму в мороз, снег, дождь). Но даже если вы беспокоитесь, что кормушка может отпасть и улететь, предусмотрена система "Якорь" (страховка), одна присоска крепится на окно внутри дома, от которой идет тонкая нить до кормушки. Кормушки снабжены инструкцией по эксплуатации. При правильном обращении имеют длительный  срок службы  и требуют минимального ухода. Если вы хотите рассматривать и фотографировать птиц без помех, то акриловые кормушки для вас!`
  },
  {
    name: "feeder_teremok",
    about: `Кормушка "Теремок" изготовлена из литого акрилового стекла производства Германии. Это кристально прозрачный материал с длительным сроком эксплуатации. В кормушке установлена деревянная деталь для удобной посадки птиц.`,
    volume: "0,2 л. корма",
    size: `150х130х50 мм.`,
    aboutText: `Для крепления на стекло используются качественные, большие прозрачные присоски, хорошо держатся при любой температуре (проверено много раз, держатся всю зиму в мороз, снег, дождь). Но даже если вы беспокоитесь, что кормушка может отпасть и улететь, предусмотрена система "Якорь" (страховка), одна присоска крепится на окно внутри дома, от которой идет тонкая нить до кормушки. Кормушки снабжены инструкцией по эксплуатации. При правильном обращении имеют длительный  срок службы  и требуют минимального ухода. Если вы хотите рассматривать и фотографировать птиц без помех, то акриловые кормушки для вас!`
  },
  {
    name: "feeder_flamingo",
    about: `Если вы хотите повесить кормушку в саду, сделайте так, чтобы это была не просто кормушка, а яркое решение, которое будет выделятся и привлекать внимание не только птиц но и ваших гостей. Наши подвесные кормушки украсят ваш сад и принесут яркие краски в серые зимние дни. Палитра цветов позволит выбрать вам то, что больше всего нравится, а качественные материалы прослужат долгие годы. Крыша и емкость для корма выполнены с прозрачного акрила, боковые части выполнены с дерева, которые покрыты водоустойчивыми матовыми красками. Для подвешивания в комплекте идет крафтовая веревка.`,
    volume: "0,8 л. корма",
    size: `190х210х140 мм.`,
    aboutText: `Если вы ищите вариант для школы, это идеальный и оригинальный вариант все что вам потребуется это крестовая отвертка.
    Возможна отправка в разобранном варианте, где в комплекте будут все детали, предварительно засверлены в местах вкручивания шурупов, шурупы, канат для подвешивания.
    Также возможно заказать без покраски деревянных деталей, и раскрасить их самостоятельно.`
  }
];

function htmlCreate(event) {
  if (event.target.classList == "feeder_details") {
    const outWrapper = event.target.closest(".feeder_out_wrapper");

    





    // let closeButton = document.createElement("div");
    // closeButton.classList.add("close_button");
    // closeButton.textContent = "X";
    // let modalOutwrapper = document.createElement("div");
    // modalOutwrapper.classList.add("modal_out_wrapper");

    // let overlay = document.createElement("div");
    // overlay.classList.add("overlay");
    // let innerWrapper = document.createElement("div");
    // innerWrapper.classList.add("modal_innerWrapper");
    // let img = document.createElement("img");
    // img.classList.add("modal_img");
    // img.src = outWrapper.dataset.src;

    // outWrapper.prepend(overlay);
    // outWrapper.append(img);
    // overlay.append(modalOutwrapper);
    // modalOutwrapper.append(innerWrapper);
    // innerWrapper.append(img, closeButton);
    // closeButton.addEventListener("click", closeModal);
  }
}

function closeModal() {
  let overlay = document.querySelector(".overlay");
  overlay.remove();
}

window.addEventListener("click", htmlCreate);
